{
  "bugData": [
    {
      "name":"Ant",
      "image":"https://images.pexels.com/photos/1104974/pexels-photo-1104974.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Ant, (family Formicidae), any of approximately 10,000 species of insects (order Hymenoptera) that are social in habit and live together in organized colonies. Ants occur worldwide but are especially common in hot climates. They range in size from about 2 to 25 mm (about 0.08 to 1 inch). Their colour is usually yellow, brown, red, or black. A few genera (e.g., Pheidole of North America) have a metallic lustre. Typically, an ant has a large head and a slender, oval abdomen joined to the thorax, or midsection, by a small waist. In all ants there are either one or two finlike extensions running across the thin waist region. The antennae are always elbowed. There are two sets of jaws: the outer pair is used for carrying objects such as food and for digging, and the inner pair is used for chewing. Some species have a powerful sting at the tip of the abdomen."
    },
    {
      "name":"Bee",
      "image":"https://images.pexels.com/photos/1035224/pexels-photo-1035224.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Bee, (superfamily Apoidea), any of more than 20,000 species of insects in the suborder Apocrita (order Hymenoptera), including the familiar honeybee (Apis) and bumblebee (Bombus and Psithyrus) as well as thousands more wasplike and flylike bees. Adults range in size from about 2 mm to 4 cm (about 0.08–1.6 inches). Bees are closely related to certain types of wasps, the principal biological difference between them being that bees (except for parasitic bees) provide their young with a mixture of pollen and honey, whereas wasps feed their young animal food or provision their nests with insects or spiders. Associated with this difference in food preference are certain structural differences, the most essential being that wasps are covered with unbranched hairs, whereas bees have at least a few branched or feathered hairs to which pollen often clings."
    },
    {
      "name":"Beetle",
      "image":"https://images.pexels.com/photos/40875/weevil-macro-arthropod-entomology-40875.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Coleopteran, (order Coleoptera), any member of the insect order Coleoptera, consisting of the beetles and weevils. It is the largest order of insects, representing about 40 percent of the known insect species. Among the over 360,000 species of Coleoptera are many of the largest and most conspicuous insects, some of which also have brilliant metallic colours, showy patterns, or striking form. Beetles can usually be recognized by their two pairs of wings; the front pair is modified into horny covers (elytra) that hide the rear pair and most of the abdomen and usually meet down the back in a straight line. Coleoptera occur in nearly all climates. They may be divided into four groups: the first three, the Archostemata, the Adephaga, and the Myxophaga, contain relatively few families; the majority of beetles are placed in the fourth group, the Polyphaga."
    },
    {
      "name":"Butterfly",
      "image":"https://images.pexels.com/photos/672142/pexels-photo-672142.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Butterfly, (superfamily Papilionoidea), any of numerous species of insects belonging to multiple families. Butterflies, along with the moths and the skippers, make up the insect order Lepidoptera. Butterflies are nearly worldwide in their distribution. The wings, bodies, and legs, like those of moths, are covered with dustlike scales that come off when the animal is handled. Unlike moths, butterflies are active during the day and are usually brightly coloured or strikingly patterned. Perhaps the most distinctive physical features of the butterfly are its club-tipped antennae and its habit of holding the wings vertically over the back when at rest. The lepidopteran life cycle has four stages: egg, larva (caterpillar), pupa (chrysalis), and adult (imago). The larvae and adults of most butterflies feed on plants, often only specific parts of specific types of plants."
    },
    {
      "name":"Bug",
      "image":"https://images.pexels.com/photos/35804/armadillo-worm-bug-insect.jpg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Who knows what this insect does"
    },
    {
      "name":"Caterpillar",
      "image":"https://images.pexels.com/photos/3743859/pexels-photo-3743859.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Caterpillar, larva of a butterfly or moth (Lepidoptera). Most caterpillars have cylindrical bodies consisting of multiple segments, with three pairs of true legs on the thorax and several pairs of short, fleshy prolegs on the abdomen. The head has six small eyes (stemmata) on each side that function in light detection but not in image formation. They have short segmented antennae and strong jaws. Many caterpillars within the order Lepidoptera are called worms, such as the measuring worm, silkworm, and armyworm. Caterpillars are known for their voracious appetites. They generally eat leaves of various types of plants, though some species eat insects or other small animals. Leaf-eating species can cause extensive damage to fruit trees, crops, ornamental plants, hardwood trees, and shrubs. For example, caterpillars of the cabbage looper moth (Trichoplusia ni) can consume three times their body weight in leaf matter daily. In addition to the damage these caterpillars cause by eating the leaves of cabbages and allied crops, the fecal matter they produce, known as frass, can stain leaves and render the plants unsaleable. Examples of insect-eating caterpillars include those of harvester butterflies (Feniseca tarquinius), which prey on woolly aphids, and the butterfly Alesa amesis, which feeds on the nymphs of insects in the order Homoptera. The snail-eating Hyposmocoma molluscivora is the only lepidopteran known to feed on a type of gastropod."
    },
    {
      "name":"Centipede",
      "image":"https://images.pexels.com/photos/5203507/pexels-photo-5203507.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Centipede, (class Chilopoda), any of various long, flattened, many-segmented predaceous arthropods. Each segment except the hindmost bears one pair of legs. Centipedes generally remain under stones, bark, and ground litter by day. At night they hunt for and capture other small invertebrates. They move rapidly on from 14 to 177 pairs of legs and have one pair of long, many-jointed antennae and a pair of jawlike, venomous claws just behind the head. The 25-mm (1-inch)-long house centipede (order Scutigerida, or Scutigeromorpha) of Europe and North America is the only one common in dwellings. It has a short, striped body and 15 pairs of very long legs. Other centipedes have shorter, hooklike legs. In some species the last pair is pincerlike."
    },
    {
      "name":"Cockroach",
      "image":"https://images.pexels.com/photos/11032990/pexels-photo-11032990.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Cockroach, (order Blattodea), also called roach, any of about 4,600 species of insects that are among the most primitive living winged insects, appearing today much like they do in fossils that are more than 320 million years old. The word cockroach is a corruption of the Spanish cucaracha. The cockroach is characterized by a flattened oval body, long threadlike antennae, and a shining black or brown leathery integument. The head is bent downward, and the mouthparts point backward instead of forward or downward as is the case in most other insects. Male cockroaches usually have two pairs of wings, whereas females, in some species, are wingless or have vestigial wings. The female produces eggs in egg cases (called oothecae). These are sometimes held protruding from her body or may be glued in protected areas. After the female deposits an egg case, the soft white nymphs emerge. As their exoskeleton hardens, it turns brown in colour. The structure and large size (certain species have a wingspread of more than 12 cm [4.7 inches]) of cockroaches have made them objects of interest in the biological laboratory."
    },
    {
      "name":"Cricket",
      "image":"https://images.pexels.com/photos/6079508/pexels-photo-6079508.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Cricket, (family Gryllidae), any of approximately 2,400 species of leaping insects (order Orthoptera) that are worldwide in distribution and known for the musical chirping of the male. Crickets vary in length from 3 to 50 mm (0.12 to 2 inches). They have thin antennae, hind legs modified for jumping, three-jointed tarsal (foot) segments, and two slender abdominal sensory appendages (called cerci). The two forewings are stiff and leathery, and the two long, membranous hind wings are used in flying. Male crickets produce musical chirping sounds by rubbing a scraper located on one forewing along a row of about 50 to 250 teeth on the opposite forewing. The frequency of the chirps depends on the number of teeth struck per second and varies from 1,500 cycles per second in the largest cricket species to nearly 10,000 cycles per second in the smallest. The most common cricket songs are the calling song, which attracts the female; the courtship, or mating, song, which induces the female to copulate; and the fighting chirp, which repels other males. Both sexes have highly sensitive organs on the forelegs for sound reception. There is a direct relationship between the rate of cricket chirps and temperature, with the rate increasing with increasing temperature."
    },
    {
      "name":"Dragonfly",
      "image":"https://images.pexels.com/photos/531587/pexels-photo-531587.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"dragonfly, (suborder Anisoptera), also called darner, devil’s arrow, or devil’s darning needle, any of a group of roughly 3,000 species of aerial predatory insects most commonly found near freshwater habitats throughout most of the world. Damselflies (suborder Zygoptera) are sometimes also called dragonflies in that both are odonates (order Odonata). Dragonfly species (Anisoptera) are characterized by long bodies with two narrow pairs of intricately veined, membranous wings that, while generally transparent, may have coloured markings. Unlike damselflies, the front and rear wing pairs are shaped differently. In addition, dragonflies rest with their wings spread horizontally, rather than held vertically against each other (with the exception of one very small family, Epiophlebiidae). Dragonflies have a more powerful build and are generally much stronger fliers than damselflies. The globe skimmer (or wandering glider, Pantala flavescens), a migratory dragonfly, for example, makes an annual multigenerational journey of some 18,000 km (about 11,200 miles); to complete the migration, individual globe skimmers fly more than 6,000 km (3,730 miles)—one of the farthest known migrations of all insect species. Dragonflies also have huge bulging eyes that occupy most of the head, giving some a field of vision approaching 360 degrees."
    },
    {
      "name":"Fly",
      "image":"https://images.pexels.com/photos/1046492/pexels-photo-1046492.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Fly, (order Diptera), any of a large number of insects characterized by the use of only one pair of wings for flight and the reduction of the second pair of wings to knobs (called halteres) used for balance. The term fly is commonly used for almost any small flying insect. However, in entomology the name refers specifically to the approximately 125,000 species of dipterans, or “true” flies, which are distributed throughout the world, including the subarctic and high mountains. Dipterans are known by such common names as gnats, midges, mosquitoes, and leaf miners, in addition to numerous sorts of flies, including the horse fly, housefly, blow fly, and fruit, bee, robber, and crane flies. Many other species of insects are called flies (e.g., dragonflies, caddisflies, and mayflies), but their wing structures serve to distinguish them from true flies. Many species of dipterans are of great importance economically, and some, such as the common housefly and certain mosquitoes, are of importance as disease carriers."
    },
    {
      "name":"Grasshopper",
      "image":"https://images.pexels.com/photos/289417/pexels-photo-289417.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Grasshopper, any of a group of jumping insects (suborder Caelifera) that are found in a variety of habitats. Grasshoppers occur in greatest numbers in lowland tropical forests, semiarid regions, and grasslands. They range in colour from green to olive or brown and may have yellow or red markings. The grasshopper senses touch through organs located in various parts of its body, including antennae and palps on the head, cerci on the abdomen, and receptors on the legs. Organs for taste are located in the mouth, and those for smell are on the antennae. The grasshopper hears by means of a tympanal organ situated in the first segment of the abdomen, which is attached to the thorax. Its sense of vision is in the compound eyes, while change in light intensity is perceived in the simple eyes (or ocelli). Although most grasshoppers are herbivorous, only a few species are important economically as crop pests."
    },
    {
      "name":"Ladybug",
      "image":"https://images.pexels.com/photos/144243/ladybugs-ladybirds-bugs-insects-144243.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Ladybug, (family Coccinellidae), also called ladybird beetle, any of approximately 5,000 widely distributed species of beetles (insect order Coleoptera) whose name originated in the Middle Ages, when the beetle was dedicated to the Virgin Mary and called “beetle of Our Lady.” Ladybird beetles are hemispheric in shape and usually 8 to 10 mm (0.3 to 0.4 inch) long. They have short legs and are usually brightly coloured with black, yellow, or reddish markings. The colour of the wing covers and number of spots vary among species. The pattern of the nine-spotted ladybird beetle (Coccinella novemnotata), which has four black spots on each reddish orange wing cover (elytron) and one shared spot, is an example of the typical colour pattern of ladybird beetles."
    },
    {
      "name":"Maggot",
      "image":"https://images.pexels.com/photos/6879/nature-leaf-bokeh-macro.jpg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"A soft-bodied legless grub that is the larva of a dipterous insect (such as the housefly)"
    },
    {
      "name":"Mosquito",
      "image":"https://images.pexels.com/photos/86722/tiger-mosquito-mosquito-asian-tigermucke-sting-86722.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Mosquito, (family Culicidae), any of approximately 3,500 species of familiar insects in the fly order, Diptera, that are important in public health because of the bloodsucking habits of the females. Mosquitoes are known to transmit serious diseases, including yellow fever, Zika fever, malaria, filariasis, and dengue. The slender, elongated body of the adult is covered with scales as are the veins of the wings. Mosquitoes are also characterized by long, fragile-looking legs and elongated, piercing mouthparts. The feathery antennae of the male are generally bushier than those of the female. The males, and sometimes the females, feed on nectar and other plant juices. In most species, however, the females require the proteins obtained from a blood meal in order to mature their eggs. Different species of mosquitoes show preferences and, in many cases, narrow restrictions as to host animals."
    },
    {
      "name":"Snail",
      "image":"https://images.pexels.com/photos/53203/snail-snail-shell-slow-animal-53203.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Snail, a gastropod, especially one having an enclosing shell, into which it may retract completely for protection. A gastropod lacking a shell is commonly called a slug or sea slug."
    },
    {
      "name":"Termite",
      "image":"https://images.pexels.com/photos/3790386/pexels-photo-3790386.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Termite, (order Isoptera), any of a group of cellulose-eating insects, the social system of which shows remarkable parallels with those of ants and bees, although it has evolved independently. Even though termites are not closely related to ants, they are sometimes referred to as white ants. Phylogenetic studies have shown that the closest relative to the termite is the cockroach; for this reason termites are sometimes placed in the order Dictyoptera, which also contains the mantids. Termites, which number about 2,750 species, are distributed widely, reaching their greatest abundance in numbers and species in tropical rainforests around the world. In North America termites are found as far north as Vancouver, British Columbia (Zootermopsis), on the Pacific coast, and Maine and eastern Canada (Reticulitermes) on the Atlantic coast. In Europe the northern limit of natural distribution is reached by Reticulitermes lucifugus on the Atlantic coast of France, although an introduced species, Reticulitermes flavipes, occurs as far north as Hamburg, Germany. The known European species of termites have a predominantly Mediterranean distribution and do not occur naturally in Great Britain, Scandinavia, Switzerland, Germany, or northern Russia. In the Far East Reticulitermes speratus ranges as far north as South Korea, Peking, and northern Japan. Termites occur also in the Cape region of South Africa, Australia, Tasmania, and New Zealand."
    },
    {
      "name":"Tick",
      "image":"https://images.pexels.com/photos/3757597/pexels-photo-3757597.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Tick, (suborder Ixodida), any of about 825 species of invertebrates in the order Parasitiformes (subclass Acari). Ticks are important parasites of large wild and domestic animals and are also significant as carriers of serious diseases. Although no species is primarily a human parasite, some occasionally attack humans. Hard ticks, such as the American dog tick (Dermacentor variabilis), attach to their hosts and feed continuously on blood for several days during each life stage. When an adult female has obtained a blood meal, she mates, drops from the host, and finds a suitable site where she lays her eggs in a mass and dies. Six-legged larvae hatch from the eggs, move up on blades of grass, and wait for a suitable host (usually a mammal) to pass by. The odour of butyric acid, emanated by all mammals, stimulates the larvae to drop onto and attach to a host. After filling themselves with the host’s blood, the larvae detach and molt, becoming eight-legged nymphs. Nymphs also wait for, and board, a suitable host in the same way as larvae. After they have found a host and engorged themselves, they also fall off, and then they molt into adult males or females. Adults may wait for a host for as long as three years."
    },
    {
      "name":"Wasp",
      "image":"https://images.pexels.com/photos/158188/insect-bee-macro-nature-158188.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Wasp, any member of a group of insects in the order Hymenoptera, suborder Apocrita, some of which are stinging. Wasps are distinguished from the ants and bees of Apocrita by various behavioral and physical characteristics, particularly their possession of a slender, smooth body and legs with relatively few hairs. Wasps also generally are predatory or parasitic and have stingers with few barbs that can be removed easily from their victims. Similar to other members of Apocrita, wasps have a narrow petiole, or “waist,” which attaches the abdomen to the thorax. Wasps have biting mouthparts and antennae with 12 or 13 segments. They are normally winged. In stinging species, only the females are provided with a formidable sting, which involves use of a modified ovipositor (egg-laying structure) for piercing and venom-producing glands. Adult wasps may feed on nectar and, in some species, on the secretions produced by larvae. Larvae of predatory wasp species typically feed on insects, while larvae of parasitic species feed on their hosts."
    },
    {
      "name":"Praying Mantis",
      "image":"https://images.pexels.com/photos/9597808/pexels-photo-9597808.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
      "description":"Mantid, (family Mantidae), also called mantis, praying mantid, or praying mantis, any of approximately 2,000 species of large, slow-moving insects that are characterized by front legs with enlarged femurs (upper portion) that have a groove lined with spines into which the tibia (lower portion) presses. Using their spined front legs, mantids, which feed exclusively on living insects, seize prey in a viselike grip. When alarmed the mantid assumes a “threatening” attitude by raising and rustling its wings (if it is a winged species) and often displays bright warning coloration. Usually found among vegetation rather than on the ground, a mantid may be disguised to resemble green or brown foliage, a dried leaf, a slender twig, a lichen, a brightly coloured flower, or an ant. This camouflage hides it from predators and also makes it inconspicuous as it stalks or awaits victims. The female, which often eats the male during mating, lays about 200 eggs in a large cocoonlike capsule (ootheca), which serves to protect the eggs from adverse weather conditions and enemies. The nymphs, which lack wings but otherwise closely resemble adults, all emerge at the same time. The nymphs are often cannibalistic."
    }
  ]
}